lab12/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= session[:current_user_id] &&
                      User.find_by_id(session[:current_user_id])