lab12/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def xml
    users = User.all.map do |user|

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user@domain.com"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "suser"], ["email", "user@domain.com"], ["password", "[FILTERED]"], ["created_at", "2022-12-18 17:41:38.735228"], ["updated_at", "2022-12-18 17:41:38.735228"]]
---
  def create
    @user = User.new(user_params)

    if User.find_by(email: @user.email)
      redirect_to :root
      return
    end
    respond_to do |format|
      if @user.save