lab12/app/views/users/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<%= button_to "Convertation", "/numfinder/input", method: :get %>
<%= button_to "Destroy this user", User.find_by_id(session[:current_user_id]), method: :delete %>