lab11/app/controllers/num_finder_controller.rb

SELECT "results".* FROM "results" WHERE "results"."in" = ? LIMIT ?  [["in", 44], ["LIMIT", 1]]
INSERT INTO "results" ("in", "out", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["in", 44], ["out", "[44,\"101100\",\"001101\",13]"], ["created_at", "2022-12-16 21:47:51.326135"], ["updated_at", "2022-12-16 21:47:51.326135"]]
---
  def output
    result = Result.find_by(in: params[:ch].to_i)
    if result
      @result_table = ActiveSupport::JSON.decode(result.out)
    else
      @result_table = calculate(params[:ch])
      (Result.create in: params[:ch].to_i, out: ActiveSupport::JSON.encode(@result_table)).save

SELECT "results".* FROM "results"
---
  def json
    @db = Result.all

SELECT "results".* FROM "results"
---
  def xml
    results = Result.all.map do |result|